{
  "nodes": [
    {
      "op": "null", 
      "name": "dataxi", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attr": {"num_hidden": "64"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout16", 
      "attr": {"p": "0.2"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attr": {"num_hidden": "10"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "M", 
      "attr": {
        "__lr_mult__": "0", 
        "__shape__": "(10, 10)"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot4", 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dataxj", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attr": {"num_hidden": "64"}, 
      "inputs": [[11, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout17", 
      "attr": {"p": "0.2"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attr": {"num_hidden": "10"}, 
      "inputs": [[14, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul20", 
      "inputs": [[10, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum4", 
      "attr": {"axis": "1"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "isinM", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul21", 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "_sub", 
      "name": "_minus4", 
      "inputs": [[19, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar8", 
      "attr": {"scalar": "0.7"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul22", 
      "inputs": [[21, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis8", 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar4", 
      "attr": {"scalar": "1"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul23", 
      "inputs": [[17, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar9", 
      "attr": {"scalar": "0.3"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul24", 
      "inputs": [[26, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis9", 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[23, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss4", 
      "inputs": [[29, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 6, 7, 9, 11, 18], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33
  ], 
  "heads": [[30, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 904]}
}